Revit 2027 API
ExtendedPropertiesLinkData.ContainerName Property
 The extended properties container name used as a custom group in the properties palette.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ContainerName { get; set; }
Public Property ContainerName As String
	Get
	Set
public:
property String^ ContainerName {
	String^ get ();
	void set (String^ value);
}
member ContainerName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given name is not valid for use as the container name of an extended properties link.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace